app/controllers/shots_controller.rb

SELECT "shots".* FROM "shots" ORDER BY created_at DESC
---
  def index

    @shots = Shot.all.order('created_at DESC')

INSERT INTO "shots" ("title", "description", "user_id", "created_at", "updated_at", "user_shot") VALUES (?, ?, ?, ?, ?, ?)
---
  def create

    #crearemos un nuevo shot con el id del usuario logueado
    @shot = current_user.shots.build(shot_params)

    respond_to do |format|
      if @shot.save

UPDATE "shots" SET "title" = ?, "description" = ?, "user_shot" = ?, "updated_at" = ? WHERE "shots"."id" = ?  [["title", "se cambio esta informacion"], ["description", "se ha cambiado la imagen"], ["user_shot", "0.jpeg"], ["updated_at", "2019-06-02 18:16:07.882203"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @shot.update(shot_params)

SELECT "shots".* FROM "shots" WHERE "shots"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_shot
      @shot = Shot.find(params[:id])